111: kd> dt _PCI_DEVICE
pci!_PCI_DEVICE
   +0x000 Signature        : Uint4B
   +0x004 DeviceState      : _PCI_OBJECT_STATE
   +0x008 TentativeNextState : _PCI_OBJECT_STATE
   +0x00c DeviceUsage      : _PCI_DEVICE_USAGE
   +0x018 BusNumber        : Uint4B
   +0x01c Slot             : _PCI_SLOT_NUMBER
   +0x020 VendorID         : Uint2B
   +0x022 DeviceID         : Uint2B
   +0x024 RevisionID       : UChar
   +0x025 BaseClass        : UChar
   +0x026 SubClass         : UChar
   +0x027 ProgIf           : UChar
   +0x028 SubVendorID      : Uint2B
   +0x02a SubSystemID      : Uint2B
   +0x02c HeaderType       : UChar
   +0x02d InterruptPin     : UChar
   +0x02e FirstCapability  : UChar
   +0x02f PowerCapability  : UChar
   +0x030 SubIDsCapability : UChar
   +0x031 AgpCapability    : UChar
   +0x032 PciXCapability   : UChar
   +0x033 AdvancedFeatures : UChar
   +0x034 MsiCapability    : UChar
   +0x035 MsiXCapability   : UChar
   +0x036 FirstHtCapability : UChar
   +0x037 HtMsiMapCapability : UChar
   +0x038 ExpressCapability : UChar
   +0x039 FpbCapability    : UChar
   +0x03a PossibleDecodes  : Uint2B
   +0x03c ResourceDecodes  : Uint2B
   +0x03e PreviousCommand  : Uint2B
   +0x040 DeviceObject     : Ptr64 _DEVICE_OBJECT
   +0x048 Root             : Ptr64 _PCI_ROOT
   +0x050 Parent           : Ptr64 _PCI_BUS
   +0x058 Sibling          : Ptr64 _PCI_DEVICE
   +0x060 RemoveLock       : _IO_REMOVE_LOCK
   +0x080 ExpressCompatibilityPort : Ptr64 _EXPRESS_COMPATIBILITY_PORT
   +0x088 ExpressPort      : Ptr64 _EXPRESS_PORT
   +0x090 HotPlugSlot      : Ptr64 _PCI_HOTPLUG_SLOT
   +0x098 InstanceIdSerialNumber : Uint8B
   +0x0a0 Resources        : _PCI_DEVICE_RESOURCES
   +0x1a8 Requirements     : _PCI_DEVICE_REQUIREMENTS
   +0x348 InterruptResource : _PCI_DEVICE_INTERRUPT_RESOURCE
   +0x3b0 InterruptRequirement : _PCI_DEVICE_INTERRUPT_REQUIREMENT
   +0x3f8 SavedRegisters   : _PCI_SAVE_RESTORE_DATA
   +0x404 CapturedProcessorCount : Uint4B
   +0x408 LogicalPowerState : _DEVICE_POWER_STATE
   +0x40c PreviousPowerState : _DEVICE_POWER_STATE
   +0x410 WakeLevel        : _DEVICE_POWER_STATE
   +0x414 PowerStateChangeDelay : Int4B
   +0x418 PowerSupport     : _PM_SUPPORT
   +0x420 PowerTimer       : Ptr64 _EX_TIMER
   +0x428 DIrp             : Ptr64 _IRP
   +0x430 WakeIrp          : Ptr64 _IRP
   +0x438 WakeIrpState     : _PCI_WAKE_IRP_STATE
   +0x43c D3ColdSupport    : _PCI_D3COLD_SUPPORT
   +0x440 TransactionTimer : _KTIMER
   +0x480 TransactionTimerDpc : _KDPC
   +0x4c0 D0DelayInMilliseconds : Uint2B
   +0x4c2 MpsSizeOverride  : Pos 0, 3 Bits
   +0x4c2 MpsSizeOverrideSet : Pos 3, 1 Bit
   +0x4c3 TransactionTimeoutPasses : UChar
   +0x4c4 DstateChangeRetryCount : UChar
   +0x4c8 D3ColdFilter     : _D3COLD_SUPPORT_INTERFACE
   +0x510 LastPmcsrWriteD0Timestamp : Uint8B
   +0x518 PreviousPowerStateTimestamp : Uint8B
   +0x520 HierarchyDepth   : Uint4B
   +0x528 WakeIrpLock      : Uint8B
   +0x530 D0IrpLock        : Uint8B
   +0x538 ConfigureMwi     : Pos 0, 1 Bit
   +0x538 BusNumbersConfigured : Pos 1, 1 Bit
   +0x538 OnDebugPath      : Pos 2, 1 Bit
   +0x538 PciOwned         : Pos 3, 1 Bit
   +0x538 LegacyDriver     : Pos 4, 1 Bit
   +0x538 NativeIdeSwitchAllowed : Pos 5, 1 Bit
   +0x538 IdeInNativeMode  : Pos 6, 1 Bit
   +0x538 IdeInterfaceActive : Pos 7, 1 Bit
   +0x538 Present          : Pos 8, 1 Bit
   +0x538 ReportedMissing  : Pos 9, 1 Bit
   +0x538 Connected        : Pos 10, 1 Bit
   +0x538 PmeOwned         : Pos 11, 1 Bit
   +0x538 PmeEnabled       : Pos 12, 1 Bit
   +0x538 TriggeredPme     : Pos 13, 1 Bit
   +0x538 HyperTransport   : Pos 14, 1 Bit
   +0x538 MsiHtConverter   : Pos 15, 1 Bit
   +0x538 ExtendedConfigAvailable : Pos 16, 1 Bit
   +0x538 B2On66MHzSegmentIllegal : Pos 17, 1 Bit
   +0x538 Device66MHzCapable : Pos 18, 1 Bit
   +0x538 DsmToIgnoreBootConfigEvaluated : Pos 19, 1 Bit
   +0x538 IgnoreBootConfig : Pos 20, 1 Bit
   +0x538 Removed          : Pos 21, 1 Bit
   +0x538 AriIsEnabled     : Pos 22, 1 Bit
   +0x538 MultiFunction    : Pos 23, 1 Bit
   +0x538 AlreadyBeenStarted : Pos 24, 1 Bit
   +0x538 WaitingForPowerUp : Pos 25, 1 Bit
   +0x538 OnPostPath       : Pos 26, 1 Bit
   +0x538 SriovDeviceDidntGetVfBarSpace : Pos 27, 1 Bit
   +0x538 ExtraBusPowerReferenceForWake : Pos 28, 1 Bit
   +0x538 FirmwareSaysDeviceDoesD3cold : Pos 29, 1 Bit
   +0x538 TransactionTimerSetPower : Pos 30, 1 Bit
   +0x538 SurpriseRemoveAndReenumerateSelf : Pos 31, 1 Bit
   +0x538 BusmasterDisabledOnBoot : Pos 32, 1 Bit
   +0x538 DsmForDelayOptimizationEvaluated : Pos 33, 1 Bit
   +0x538 NoInitialConfig  : Pos 34, 1 Bit
   +0x538 DisableWheaDuringPLDR : Pos 35, 1 Bit
   +0x538 WheaReportingDisabled : Pos 36, 1 Bit
   +0x538 SecureDevice     : Pos 37, 1 Bit
   +0x538 DmaProtected     : Pos 38, 1 Bit
   +0x538 IsThunderboltDevice : Pos 39, 1 Bit
   +0x538 DecodeIoOnBoot   : Pos 40, 1 Bit
   +0x538 FpbNeedRestore   : Pos 41, 1 Bit
   +0x538 ForceSBR         : Pos 42, 1 Bit
   +0x538 IsGuestAssigned  : Pos 43, 1 Bit
   +0x538 SurpriseRemoveAndReenumerateSelfResetDevice : Pos 44, 1 Bit
   +0x538 Reserved         : Pos 45, 19 Bits
   +0x538 FlagsAsULONGLONG : Uint8B
   +0x540 BridgeFlags      : <unnamed-tag>
   +0x548 HackFlags        : Uint8B
   +0x550 Operations       : Ptr64 _PCI_HEADER_OPERATIONS
   +0x558 PciBusInterfaceCount : Int4B
   +0x55c AgpTargetInterfaceRefCount : Int4B
   +0x560 PciCardBusInterfaceCount : Int4B
   +0x564 PciDevicePresentInterfaceCount : Int4B
   +0x568 PciNativeIdeInterfaceCount : Int4B
   +0x56c PciLocationInterfaceCount : Int4B
   +0x570 PciD3ColdSupportInterfaceCount : Int4B
   +0x574 PciD3ColdAuxPowerAndTimingInterfaceCount : Int4B
   +0x578 PciPtmControlInterfaceCount : Int4B
   +0x57c EnumFailureCode  : Uint4B
   +0x580 DebugDevicePowerCallbackHandle : Ptr64 Void
   +0x588 DelayInfo        : [8] Int4B
   +0x5a8 SecureDeviceToken : Uint8B
   +0x5b0 D3ColdAux        : _PCI_D3COLD_AUX_POWER_AND_TIMING_DEVICE_INFO
   +0x5d8 FpbPdoNode       : _PCI_FPB_PDO


;NTSTATUS PciDevice_Start(
;    __in PIRP Irp,
;    __in PIO_STACK_LOCATION IrpSp,
;    __inout PPCI_COMMON_EXTENSION DeviceExtension);
; RCX seems useless. all operation are done in IrpSp.

111: kd> uf PciDevice_Start
Flow analysis was incomplete, some code may be missing
pci!PciDevice_Start:
fffff801`803ca990 48895c2408      mov     qword ptr [rsp+8],rbx
fffff801`803ca995 55              push    rbp
fffff801`803ca996 56              push    rsi
fffff801`803ca997 57              push    rdi
fffff801`803ca998 4154            push    r12
fffff801`803ca99a 4155            push    r13
fffff801`803ca99c 4156            push    r14
fffff801`803ca99e 4157            push    r15
fffff801`803ca9a0 488dac24d0fcffff lea     rbp,[rsp-330h]
fffff801`803ca9a8 4881ec30040000  sub     rsp,430h
fffff801`803ca9af 488b057a18ffff  mov     rax,qword ptr [pci!_security_cookie (fffff801`803bc230)]
fffff801`803ca9b6 4833c4          xor     rax,rsp
